#!/bin/bash

INP=$1
OUTP=$2

[[ -z $INP ]] && exit 1
[[ -z $OUTP ]] && exit 1

#sed 's/По настоящее время\s\+([0-9а-я ]*)/now/g' $INP > ${OUTP}.1
#sed 's/&#8203;[0-9\.]*&#8203;//g' ${OUTP}.1 > ${OUTP}.2
#sed 's/\&amp;/\&/g' ${OUTP}.2 > ${OUTP}.3
#sed 's/\&amp;/\&/g' ${OUTP}.3 > ${OUTP}.4
#sed 's/\&amp;/\&/g' ${OUTP}.4 > ${OUTP}.5
#sed 's/\&quot;/""/g' ${OUTP}.5 > ${OUTP}.6

sed 's/\(Январь\|Февраль\|Март\|Апрель\|Май\|Июнь|Июль|Август|Сентябрь|Октябрь|Ноябрь|Декабрь) [0-9]+)\s\+([0-9а-я ]*)/\1/g' ${OUTP}.6 > ${OUTP}.7
